[V11.5 - Updated May 10, 2022]
1-2=Optimized Bundleware to detect more bundleware more accurately
2-2=Enhanced Software Health to detect and fix more software issues
3-2=Optimized Install Monitor for more comprehensive and accurate monitoring
4-3=Fixed all known bugs

[V11.4 - Updated March 24, 2022]
1-2=Improved scanning algorithms to detect and clean more leftovers
2-2=Improved Stubborn Program Remover to detect programs with uninstall issues more accurately
3-2=Expanded database to remove 28% more malicious/ads plugins for faster and more secure browsing
4-3=Fixed all known bugs 

[V11.3 - Updated February 10, 2022]
1-2=Enlarged database to remove 2000+ stubborn programs
2-2=Improved Software Health to remove more uninstallation leftovers
3-2=Optimized the algorithms to match software permissions more accurately in Software Health
4-3=Fixed the update failure in Discord, Irfanview, and WinZip
5-3=Fixed the occasional failure of detecting plugins on some versions of Firefox
6-3=Fixed all known bugs  

[V11.2 - Updated December 16, 2021]
1-1=Added support for installing and uninstalling Android apps via Windows Subsystem for Android (WSA) on Windows11
2-1=Newly support associating APK files with IObit Uninstaller for easier installation by double-clicking APK files
3-2=Improved the algorithms for more accurate leftover detection
4-2=Optimized leftover deletion process to notify users before deleting important personal data
5-2=Optimized Install Monitor for more comprehensive and accurate monitoring
6-2=Enlarged database to remove 300 more stubborn programs
7-1=New language added: Bulgarian
8-3=Fixed all known bugs

[V11.1 - Updated October 18, 2021]
1-2=Enhanced leftover scanning algorithms to find and clean more leftovers
2-1=Software Health now supports disabling Firewall permissions
3-2=More customizable options for Software Health
4-1=Added support of customizing Infrequently Used Programs and Large Programs
5-2=Enlarged database to remove 500 more stubborn programs
6-1=Supported F5 refresh
7-1=Language added: Latvian
8-3=Fixed all known bugs

[V11.0 - Updated August 25, 2021]
1-1=<a>Brand-new Software Health</a> helps manage software permissions, block popup notifications, clean unneeded setup files, and remove malicious software & browser extensions
2-2=<a>More powerful uninstall engine</a> eliminates residual files more completely with advanced scanning and cleaning algorithms
3-2=<a>More in-depth Install Monitor</a> can log more items (including startups) created during the installation process for future thorough uninstall
4-2=<a>50% larger database</a> supports updating more popular software, including AnyDesk, Calibre, Discord, LibreOffice, and qBittorrent
5-2=<a>Unique Stubborn Program Remover database</a> supports removing 1000+ stubborn programs
6-2=<a>Reinforced Force Uninstall+</a> can easily uninstall programs when uninstall registries are missing
7-1=<a>Newly added Windows Apps rating</a> helps users know more about removing unwanted Windows Apps
8-2=<a>Improved the removal process</a> of browser extensions
9-2=<a>Better UI</a> for more user-friendly experience
10-2=<a>Two skins:</a> dark and light
11-2=<a>Supported 37 languages</a>
12-1=<a>Fully supported Windows 11</a>

[Lan]
1=New
2=Improved
3=Bug Fix